Autodesk.Revit.Creation.ItemFactoryBase.NewReferencePlane2(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.View)
Creates a new instance of ReferencePlane.
bubbleEnd:  The bubble end applied to reference plane.
freeEnd:  The free end applied to reference plane.
thirdPnt:  A third point needed to define the reference plane.
pView:  The specific view apply to the Reference plane.
Returns:  The newly created reference plane.
Remarks: The specific view is applied to the Reference plane only for certain view types:
Autodesk.Revit.DB.ViewType.LegendAutodesk.Revit.DB.ViewType.DraftingViewAutodesk.Revit.DB.ViewType.DrawingSheet

Autodesk.Revit.Creation.ItemFactoryBase.NewReferencePlane(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.View)
Creates a new instance of ReferencePlane.
bubbleEnd:  The bubble end applied to reference plane.
freeEnd:  The free end applied to reference plane.
cutVec:  The cut vector apply to reference plane, should perpendicular
to the vector  (bubbleEnd-freeEnd).
pView:  The specific view apply to the Reference plane.
Returns:  The newly created reference plane.
Remarks: The specific view is applied to the Reference plane only for certain view types:
Autodesk.Revit.DB.ViewType.LegendAutodesk.Revit.DB.ViewType.DraftingViewAutodesk.Revit.DB.ViewType.DrawingSheet

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstance(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Structure.StructuralType)
Inserts a new instance of a family into the document,
using a location, type/symbol, and the level.
location: The physical location where the instance is to be placed.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
level: The level onto which the FamilyInstance is to be placed.
structuralType:  If structural then specify the type of the component.
Returns: If creation was successful then an instance to the new object is returned, otherwise null.
Remarks: This method is used to place a family instance onto a level. If the instance fails to be created an exception may be thrown.
The type/symbol that is used must be loaded into the document
before this method is called. Families and their symbols can be loaded using the Document.LoadFamily
or Document.LoadFamilySymbol methods. Some Families, such as Beams, have more than one endpoint
and are inserted in the same manner as single point instances. Once inserted these linear family
instances can have their endpoints changed by using the instance's Element.Location property.Note: ForbiddenForDynamicUpdateException might be thrown during a dynamic update if the inserted instance establishes a mutual dependency with another structure.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the family symbol does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the level does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if The symbol is not active.

Autodesk.Revit.Creation.ItemFactoryBase.NewDimension(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.ReferenceArray,Autodesk.Revit.DB.DimensionType)
Creates a new linear dimension object using the specified dimension style.
view:  The view in which the dimension is to be visible.
The view must be null if the document is in Autodesk::Revit::DB::SketchEditScope.
line:  The line drawn for the dimension.
references:  An array of geometric references to which the dimension is to be bound.
dimensionType:  The dimension style to be used for the dimension.
Returns:  If successful a new dimension object, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when references are not geometric references.

Autodesk.Revit.Creation.ItemFactoryBase.NewDimension(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.ReferenceArray)
Creates a new linear dimension object.
Creates a new linear dimension object using the default dimension style.
view:  The view in which the dimension is to be visible.
The view must be null if the document is in Autodesk::Revit::DB::SketchEditScope.
line:  The line drawn for the dimension.
references:  An array of geometric references to which the dimension is to be bound.
Returns:  If successful a new dimension object, otherwise null.
Remarks:  The currently user set default style is used for the created dimension.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when references are not geometric references.